import pandas
KB={("точіння", "перевага", "універсальність"),
    ("точіння", "перевага", "продуктивність"),
    ("точіння", "перевага", "точність"),
    ("точіння", "перевага", "простий інструмент"),
    ("точіння", "недолік",  "нетехнологічність"),
    ("нарізання мітчиком", "перевага", "технологічність"),
    ("нарізання мітчиком", "недолік", "спеціальний інструмент")}
df = pandas.DataFrame(columns=["s","p","o"])
i=0
for s,p,o in KB:
    df.loc[i]={"s":s, "p":p, "o":o}
    i+=1
#df.to_csv('kb.csv', index=False)
df = pandas.read_csv('kb.csv')